stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_ble.c
 * @author  MCD Application Team
 * @brief   BLE Application
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "ble.h"
#include "app_ble.h"
#include "cmsis_os2.h"
#include "host_stack_if.h"
#include "ll_sys_if.h"
#include "stm32_rtos.h"
#include "otp.h"
#include "stm32_timer.h"
#include "stm_list.h"
#include "advanced_memory_manager.h"
#include "blestack.h"
#include "nvm.h"
#include "simple_nvm_arbiter.h"
#include "custom_stm.h"
#include "app_matter.h"
#include "CHIPProjectConfig.h"
#if (CONFIG_STM32_FACTORY_DATA_ENABLE == 1)
#include "stm32_factorydata.h"
#endif /* CONFIG_STM32_FACTORY_DATA_ENABLE */


/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Security parameters structure */
typedef struct {
	/* IO capability of the device */
	uint8_t ioCapability;

	/**
	 * Authentication requirement of the device
	 * Man In the Middle protection required?
	 */
	uint8_t mitm_mode;

	/* Bonding mode of the device */
	uint8_t bonding_mode;

	/**
	 * this variable indicates whether to use a fixed pin
	 * during the pairing process or a passkey has to be
	 * requested to the application during the pairing process
	 * 0 implies use fixed pin and 1 implies request for passkey
	 */
	uint8_t Use_Fixed_Pin;

	/* Minimum encryption key size requirement */
	uint8_t encryptionKeySizeMin;

	/* Maximum encryption key size requirement */
	uint8_t encryptionKeySizeMax;

	/**
	 * fixed pin to be used in the pairing process if
	 * Use_Fixed_Pin is set to 1
	 */
	uint32_t Fixed_Pin;

	/**
	 * this flag indicates whether the host has to initiate
	 * the security, wait for pairing or does not have any security
	 * requirements.
	 * 0x00 : no security required
	 * 0x01 : host should initiate security by sending the slave security
	 *        request command
	 * 0x02 : host need not send the clave security request but it
	 * has to wait for paiirng to complete before doing any other
	 * processing
	 */
	uint8_t initiateSecurity;
/* USER CODE BEGIN tSecurityParams*/

/* USER CODE END tSecurityParams */
} SecurityParams_t;

/* Global context contains all BLE common variables. */
typedef struct {
	/* Security requirements of the host */
	SecurityParams_t bleSecurityParam;

	/* GAP service handle */
	uint16_t gapServiceHandle;

	/* Device name characteristic handle */
	uint16_t devNameCharHandle;

	/* Appearance characteristic handle */
	uint16_t appearanceCharHandle;

	/**
	 * connection handle of the current active connection
	 * When not in connection, the handle is set to 0xFFFF
	 */
	uint16_t connectionHandle;

/* USER CODE BEGIN BleGlobalContext_t*/

/* USER CODE END BleGlobalContext_t */
} BleGlobalContext_t;

typedef struct {
	BleGlobalContext_t BleApplicationContext_legacy;
	APP_BLE_ConnStatus_t Device_Connection_Status;
	/* USER CODE BEGIN PTD_1*/
	uint8_t connIntervalFlag;
/* USER CODE END PTD_1 */
} BleApplicationContext_t;

/* Private defines -----------------------------------------------------------*/
/* GATT buffer size (in bytes)*/
#define BLE_GATT_BUF_SIZE \
          BLE_TOTAL_BUFFER_SIZE_GATT(CFG_BLE_NUM_GATT_ATTRIBUTES, \
                                     CFG_BLE_NUM_GATT_SERVICES, \
                                     CFG_BLE_ATT_VALUE_ARRAY_SIZE)

#define MBLOCK_COUNT              (BLE_MBLOCKS_CALC(PREP_WRITE_LIST_SIZE, \
                                                    CFG_BLE_ATT_MTU_MAX, \
                                                    CFG_BLE_NUM_LINK) \
                                   + CFG_BLE_MBLOCK_COUNT_MARGIN)

#define BLE_DYN_ALLOC_SIZE \
        (BLE_TOTAL_BUFFER_SIZE(CFG_BLE_NUM_LINK, MBLOCK_COUNT))

/* USER CODE BEGIN PD */
#define ADV_TIMEOUT_MS                 (60 * 1000)

      
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static tListNode BleAsynchEventQueue;

static const uint8_t a_MBdAddr[BD_ADDR_SIZE] = {
        (uint8_t) ((CFG_BD_ADDRESS & 0x0000000000FF)),
		(uint8_t) ((CFG_BD_ADDRESS & 0x00000000FF00) >> 8),
		(uint8_t) ((CFG_BD_ADDRESS & 0x000000FF0000) >> 16),
		(uint8_t) ((CFG_BD_ADDRESS & 0x0000FF000000) >> 24),
		(uint8_t) ((CFG_BD_ADDRESS & 0x00FF00000000) >> 32),
		(uint8_t) ((CFG_BD_ADDRESS & 0xFF0000000000) >> 40) };

static uint8_t a_BdAddrUdn[BD_ADDR_SIZE];

/* Identity root key used to derive IRK and DHK(Legacy) */
static const uint8_t a_BLE_CfgIrValue[16] = CFG_BLE_IR;

/* Encryption root key used to derive LTK(Legacy) and CSRK */
static const uint8_t a_BLE_CfgErValue[16] = CFG_BLE_ER;
static BleApplicationContext_t bleAppContext;
MATTER_App_Notification_evt_t handleNotification;

static const uint8_t a_GapDeviceName[] = { 'S', 'T', '_', 'W', 'B', 'A', '_',
		'M', 'A', 'T', 'T', 'E', 'R' }; /* Gap Device Name */

/* Advertising Data */
/* ADV for matter */
/* Byte 8 to 13 to be overwritten with default or Factory Data value */
/* Byte 8-9  : Discriminator */
/* Byte 10-11: VendorID      */
/* Byte 12-13: ProductID     */

uint8_t a_AdvData[15] = { 0x02, AD_TYPE_FLAGS, 0x06,
		                  0x0B, AD_TYPE_SERVICE_DATA, 0xF6, 0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

uint64_t buffer_nvm[CFG_BLEPLAT_NVM_MAX_SIZE] = { 0 };

static AMM_VirtualMemoryCallbackFunction_t APP_BLE_ResumeFlowProcessCb;

/* Host stack init variables */
static uint32_t buffer[DIVC(BLE_DYN_ALLOC_SIZE, 4)];
static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE, 4)];
static BleStack_init_t pInitParams;

