stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
/* BLE_STACK_TASK related resources */
osSemaphoreId_t BleStackSemaphore;
osThreadId_t BleStackThread;

osThreadId_t HCIasyncEvtThread;

osSemaphoreId_t ProcGapCompleteSemaphore;
/* HCI_ASYNC_EVT_TASK related resources */
osSemaphoreId_t HCIasyncEvtSemaphore;

osTimerId_t SwitchOffLedTimerId;

const osThreadAttr_t stBleStackTaskAttributes = {
		.name = "BLE Stack Task",
		.priority = CFG_TASK_PRIO_BLE_STACK,
		.stack_size = TASK_BLE_STACK_STACK_SIZE, };

const osThreadAttr_t stHCIasyncEvtTaskAttributes = {
		.name =	"HCI asynch event Task",
		.priority = CFG_TASK_PRIO_HCI_ASYNCH_EVT,
		.stack_size = TASK_HCI_ASYNCH_EVT_STACK_SIZE };

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static void BleStack_Process_BG(void);
static void Ble_UserEvtRx(void);
static void BLE_ResumeFlowProcessCallback(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
static void BLE_NvmCallback(SNVMA_Callback_Status_t);
static uint8_t HOST_BLE_Init(void);
static void BleUserEvtRx_Task_Entry(void *thread_input);
static void BleStack_Task_Entry(void *thread_input);
/* USER CODE BEGIN PFP */
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size,
		const uint8_t *p_bd_addr);

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void) {
	/* USER CODE BEGIN APP_BLE_Init_1 */

	/* USER CODE END APP_BLE_Init_1 */

	LST_init_head(&BleAsynchEventQueue);

	const osSemaphoreAttr_t BleStackSemaphore_attributes = {
			.name =	"BLE stack Semaphore" };

	BleStackSemaphore = osSemaphoreNew(1U, 0U, &BleStackSemaphore_attributes);

	if (BleStackSemaphore == NULL) {
		Error_Handler();
	}

	BleStackThread = osThreadNew(BleStack_Task_Entry, NULL,
			&stBleStackTaskAttributes);

	if (BleStackThread == NULL) {
		Error_Handler();
	}

	const osSemaphoreAttr_t HCIasyncEvtSemaphore_attributes = {
			.name =	"HCI asynch EVT Semaphore" };

	HCIasyncEvtSemaphore = osSemaphoreNew(1U, 0U,
			&HCIasyncEvtSemaphore_attributes);

	if (HCIasyncEvtSemaphore == NULL) {
		Error_Handler();
	}

	HCIasyncEvtThread = osThreadNew(BleUserEvtRx_Task_Entry, NULL,
			&stHCIasyncEvtTaskAttributes);

	if (HCIasyncEvtThread == NULL) {
		Error_Handler();
	}

	/* NVM emulation in RAM initialization */
	NVM_Init(buffer_nvm, 0, CFG_BLEPLAT_NVM_MAX_SIZE);

	/* First register the APP BLE buffer */
	SNVMA_Register(APP_BLE_NvmBuffer, (uint32_t*) buffer_nvm,
			(CFG_BLEPLAT_NVM_MAX_SIZE * 2));

	/* Realize a restore */
	SNVMA_Restore(APP_BLE_NvmBuffer);
	/* USER CODE BEGIN APP_BLE_Init_Buffers */

	/* USER CODE END APP_BLE_Init_Buffers */

	/* Check consistency */
	if (NVM_Get(NVM_FIRST, 0xFF, 0, 0, 0) != NVM_EOF) {
		NVM_Discard(NVM_ALL);
	}

	/* Initialize the BLE Host */
	if (HOST_BLE_Init() == 0u) {
		/* Initialization of HCI & GATT & GAP layer */
		Ble_Hci_Gap_Gatt_Init();

		const osSemaphoreAttr_t ProcGapCompleteSemaphore_attributes = {
				.name =	"ProcGapCompleteSemaphore" };

		ProcGapCompleteSemaphore = osSemaphoreNew(1U, 0U,
				&ProcGapCompleteSemaphore_attributes);
		if (ProcGapCompleteSemaphore == NULL) {
			Error_Handler();
		}

		/* Initialization of the BLE Services */
		SVCCTL_Init();

		/* Initialization of the BLE App Context */
		bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
		bleAppContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

		/* From here, all initialization are BLE application specific */

		/* USER CODE BEGIN APP_BLE_Init_4 */

		/* USER CODE END APP_BLE_Init_4 */

		SVCCTL_InitCustomSvc();
		/* USER CODE BEGIN APP_BLE_Init_3 */


		/* USER CODE END APP_BLE_Init_3 */

	}
	/* USER CODE BEGIN APP_BLE_Init_2 */
	bleAppContext.connIntervalFlag = 0;
	/* USER CODE END APP_BLE_Init_2 */

	/**
	 * Initialize Matter Application
	 */
	APP_MATTER_Init();

	return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt) {
	tBleStatus ret = BLE_STATUS_ERROR;
	hci_event_pckt *p_event_pckt;
	evt_le_meta_event *p_meta_evt;
	evt_blecore_aci *p_blecore_evt;

	p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt*) p_Pckt)->data;
	UNUSED(ret);
	/* USER CODE BEGIN SVCCTL_App_Notification */

	/* USER CODE END SVCCTL_App_Notification */

	switch (p_event_pckt->evt) {
	case HCI_DISCONNECTION_COMPLETE_EVT_CODE: {
		hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
		p_disconnection_complete_event =
				(hci_disconnection_complete_event_rp0*) p_event_pckt->data;
		if (p_disconnection_complete_event->Connection_Handle
				== bleAppContext.BleApplicationContext_legacy.connectionHandle) {
			bleAppContext.BleApplicationContext_legacy.connectionHandle = 0;
			bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
			LOG_INFO_APP(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
			LOG_INFO_APP(
					"     - Connection Handle:   0x%02X\n     - Reason:    0x%02X\n",
					p_disconnection_complete_event->Connection_Handle,
					p_disconnection_complete_event->Reason);

			/* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

			/* USER CODE END EVT_DISCONN_COMPLETE_2 */
		}
		gap_cmd_resp_release();

		/* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

		/* USER CODE END EVT_DISCONN_COMPLETE_1 */
		handleNotification.Evt_Opcode = MATTER_STM_DISCON_HANDLE_EVT;
		handleNotification.ConnectionHandle =
				p_disconnection_complete_event->Connection_Handle;
		APP_MATTER_Notification(&handleNotification);

		/* USER CODE BEGIN EVT_DISCONN_COMPLETE */
		/* USER CODE END EVT_DISCONN_COMPLETE */
		break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
	}

	case HCI_LE_META_EVT_CODE: {
		p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
		/* USER CODE BEGIN EVT_LE_META_EVENT */

		/* USER CODE END EVT_LE_META_EVENT */
		switch (p_meta_evt->subevent) {
		case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE: {
			uint16_t conn_interval_us = 0;
			hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
			p_conn_update_complete =
					(hci_le_connection_update_complete_event_rp0*) p_meta_evt->data;
			conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
			LOG_INFO_APP(
					">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
			LOG_INFO_APP(
					"     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
					conn_interval_us / 1000, (conn_interval_us % 1000) / 10,
					p_conn_update_complete->Conn_Latency,
					p_conn_update_complete->Supervision_Timeout * 10);
			UNUSED(p_conn_update_complete);

