stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
			/* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

			/* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
			break;
		}
		case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE: {
			hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
			p_le_phy_update_complete =
					(hci_le_phy_update_complete_event_rp0*) p_meta_evt->data;
			UNUSED(p_le_phy_update_complete);

			gap_cmd_resp_release();

			/* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

			/* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
			break;
		}
		case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE: {
			uint16_t conn_interval_us = 0;
			hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
			p_enhanced_conn_complete =
					(hci_le_enhanced_connection_complete_event_rp0*) p_meta_evt->data;
			conn_interval_us = p_enhanced_conn_complete->Conn_Interval * 1250;
			LOG_INFO_APP(
					">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
					p_enhanced_conn_complete->Connection_Handle);
			LOG_INFO_APP(
					"     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
					p_enhanced_conn_complete->Peer_Address[5],
					p_enhanced_conn_complete->Peer_Address[4],
					p_enhanced_conn_complete->Peer_Address[3],
					p_enhanced_conn_complete->Peer_Address[2],
					p_enhanced_conn_complete->Peer_Address[1],
					p_enhanced_conn_complete->Peer_Address[0]);
			LOG_INFO_APP(
					"     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
					conn_interval_us / 1000, (conn_interval_us % 1000) / 10,
					p_enhanced_conn_complete->Conn_Latency,
					p_enhanced_conn_complete->Supervision_Timeout * 10);

			if (bleAppContext.Device_Connection_Status
					== APP_BLE_LP_CONNECTING) {
				/* Connection as client */
				bleAppContext.Device_Connection_Status =
						APP_BLE_CONNECTED_CLIENT;
			} else {
				/* Connection as server */
				bleAppContext.Device_Connection_Status =
						APP_BLE_CONNECTED_SERVER;
			}
			bleAppContext.BleApplicationContext_legacy.connectionHandle =
					p_enhanced_conn_complete->Connection_Handle;

			/* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */

			/* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
			break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
		}
		case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE: {
			uint16_t conn_interval_us = 0;
			hci_le_connection_complete_event_rp0 *p_conn_complete;
			p_conn_complete =
					(hci_le_connection_complete_event_rp0*) p_meta_evt->data;
			conn_interval_us = p_conn_complete->Conn_Interval * 1250;
			LOG_INFO_APP(
					">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
					p_conn_complete->Connection_Handle);
			LOG_INFO_APP(
					"     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
					p_conn_complete->Peer_Address[5],
					p_conn_complete->Peer_Address[4],
					p_conn_complete->Peer_Address[3],
					p_conn_complete->Peer_Address[2],
					p_conn_complete->Peer_Address[1],
					p_conn_complete->Peer_Address[0]);
			LOG_INFO_APP(
					"     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
					conn_interval_us / 1000, (conn_interval_us % 1000) / 10,
					p_conn_complete->Conn_Latency,
					p_conn_complete->Supervision_Timeout * 10);

			if (bleAppContext.Device_Connection_Status
					== APP_BLE_LP_CONNECTING) {
				/* Connection as client */
				bleAppContext.Device_Connection_Status =
						APP_BLE_CONNECTED_CLIENT;
			} else {
				/* Connection as server */
				bleAppContext.Device_Connection_Status =
						APP_BLE_CONNECTED_SERVER;
			}
			bleAppContext.BleApplicationContext_legacy.connectionHandle =
					p_conn_complete->Connection_Handle;

			hci_le_set_data_length(
					bleAppContext.BleApplicationContext_legacy.connectionHandle,
					251, 2120);
			handleNotification.Evt_Opcode = MATTER_STM_CONN_HANDLE_EVT;
			handleNotification.ConnectionHandle =
					bleAppContext.BleApplicationContext_legacy.connectionHandle;
			APP_MATTER_Notification(&handleNotification);

			/* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
			
			/* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
			break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
		}
			/* USER CODE BEGIN SUBEVENT */

			/* USER CODE END SUBEVENT */
		default: {
			/* USER CODE BEGIN SUBEVENT_DEFAULT */

			/* USER CODE END SUBEVENT_DEFAULT */
			break;
		}
		}

		/* USER CODE BEGIN META_EVT */

		/* USER CODE END META_EVT */
	}
		break; /* HCI_LE_META_EVT_CODE */

	case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE: {
		p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
		/* USER CODE BEGIN EVT_VENDOR */

		/* USER CODE END EVT_VENDOR */
		switch (p_blecore_evt->ecode) {
		/* USER CODE BEGIN ECODE */

		/* USER CODE END ECODE */
		case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE: {
			aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp;
			p_l2cap_conn_update_resp =
					(aci_l2cap_connection_update_resp_event_rp0*) p_blecore_evt->data;
			UNUSED(p_l2cap_conn_update_resp);
			/* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

			/* USER CODE END EVT_L2CAP_CONNECTION_UPDATE_RESP */
			break;
		}
		case ACI_GAP_PROC_COMPLETE_VSEVT_CODE: {
			aci_gap_proc_complete_event_rp0 *p_gap_proc_complete;
			p_gap_proc_complete =
					(aci_gap_proc_complete_event_rp0*) p_blecore_evt->data;
			UNUSED(p_gap_proc_complete);

			LOG_INFO_APP(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
			/* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */

			/* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
			break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
		}
		case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE: {
			/* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/

			/* USER CODE END RADIO_ACTIVITY_EVENT*/
			break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
		}
		case ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE: {
			LOG_INFO_APP(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
			/* USER CODE BEGIN ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/

