stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
			/* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
			break;
		}
		case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE: {
			uint32_t pin;
			LOG_INFO_APP(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE\n");

			pin = CFG_FIXED_PIN;
			/* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE_0 */

			/* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE_0 */

			ret = aci_gap_pass_key_resp(
					bleAppContext.BleApplicationContext_legacy.connectionHandle,
					pin);
			if (ret != BLE_STATUS_SUCCESS) {
				LOG_INFO_APP(
						"==>> aci_gap_pass_key_resp : Fail, reason: 0x%02X\n",
						ret);
			} else {
				LOG_INFO_APP("==>> aci_gap_pass_key_resp : Success\n");
			}
			/* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/

			/* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/
			break;
		}
		case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE: {
			uint8_t confirm_value;
			LOG_INFO_APP(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
			LOG_INFO_APP("     - numeric_value = %ld\n",
					((aci_gap_numeric_comparison_value_event_rp0* )(p_blecore_evt->data))->Numeric_Value);
			LOG_INFO_APP("     - Hex_value = %lx\n",
					((aci_gap_numeric_comparison_value_event_rp0* )(p_blecore_evt->data))->Numeric_Value);

			/* Set confirm value to 1(YES) */
			confirm_value = 1;
			/* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0*/

			/* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0*/

			ret = aci_gap_numeric_comparison_value_confirm_yesno(
					bleAppContext.BleApplicationContext_legacy.connectionHandle,
					confirm_value);
			if (ret != BLE_STATUS_SUCCESS) {
				LOG_INFO_APP(
						"==>> aci_gap_numeric_comparison_value_confirm_yesno : Fail, reason: 0x%02X\n",
						ret);
			} else {
				LOG_INFO_APP(
						"==>> aci_gap_numeric_comparison_value_confirm_yesno : Success\n");
			}
			/* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/

			/* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
			break;
		}
		case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE: {
			LOG_INFO_APP(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
			aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
			p_pairing_complete =
					(aci_gap_pairing_complete_event_rp0*) p_blecore_evt->data;

			if (p_pairing_complete->Status != 0) {
				LOG_INFO_APP(
						"     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
						p_pairing_complete->Status, p_pairing_complete->Reason);
			} else {
				LOG_INFO_APP("     - Pairing Success\n");
			}
			LOG_INFO_APP("\n");

			/* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/

			/* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
			break;
		}
		case ACI_GAP_BOND_LOST_VSEVT_CODE: {
			LOG_INFO_APP(">>== ACI_GAP_BOND_LOST_EVENT\n");
			ret =
					aci_gap_allow_rebond(
							bleAppContext.BleApplicationContext_legacy.connectionHandle);
			if (ret != BLE_STATUS_SUCCESS) {
				LOG_INFO_APP(
						"==>> aci_gap_allow_rebond : Fail, reason: 0x%02X\n",
						ret);
			} else {
				LOG_INFO_APP("==>> aci_gap_allow_rebond : Success\n");
			}
			/* USER CODE BEGIN ACI_GAP_BOND_LOST_VSEVT_CODE*/

			/* USER CODE END ACI_GAP_BOND_LOST_VSEVT_CODE*/
			break;
		}
			/* USER CODE BEGIN ECODE_1 */

			/* USER CODE END ECODE_1 */
		default: {
			/* USER CODE BEGIN ECODE_DEFAULT*/

			/* USER CODE END ECODE_DEFAULT*/
			break;
		}
		}
		/* USER CODE BEGIN EVT_VENDOR_1 */

		/* USER CODE END EVT_VENDOR_1 */
	}
		break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
		/* USER CODE BEGIN EVENT_PCKT */

		/* USER CODE END EVENT_PCKT */
	default: {
		/* USER CODE BEGIN EVENT_PCKT_DEFAULT*/

		/* USER CODE END EVENT_PCKT_DEFAULT*/
		break;
	}
	}

	/* USER CODE BEGIN SVCCTL_App_Notification_1 */

	/* USER CODE END SVCCTL_App_Notification_1 */

	return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void) {
	return bleAppContext.Device_Connection_Status;
}

void APP_BLE_Procedure_Gap_General(ProcGapGeneralId_t ProcGapGeneralId) {
	tBleStatus status;
	uint8_t phy_tx, phy_rx;

	switch (ProcGapGeneralId) {
	case PROC_GAP_GEN_PHY_TOGGLE: {
		osMutexAcquire(LinkLayerMutex, osWaitForever);
		status = hci_le_read_phy(
				bleAppContext.BleApplicationContext_legacy.connectionHandle,
				&phy_tx, &phy_rx);
		osMutexRelease(LinkLayerMutex);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("hci_le_read_phy failure: reason=0x%02X\n", status);
		} else {
			LOG_INFO_APP("==>> hci_le_read_phy - Success\n");
			LOG_INFO_APP("==>> PHY Param  TX= %d, RX= %d\n", phy_tx, phy_rx);
			if ((phy_tx == HCI_TX_PHY_LE_2M) && (phy_rx == HCI_RX_PHY_LE_2M)) {
				LOG_INFO_APP("==>> hci_le_set_phy PHY Param  TX= %d, RX= %d - ",
						HCI_TX_PHY_LE_1M, HCI_RX_PHY_LE_1M);
				status =
						hci_le_set_phy(
								bleAppContext.BleApplicationContext_legacy.connectionHandle,
								0, HCI_TX_PHYS_LE_1M_PREF,
								HCI_RX_PHYS_LE_1M_PREF, 0);
				if (status != BLE_STATUS_SUCCESS) {
					LOG_INFO_APP("Fail\n");
				} else {
					LOG_INFO_APP("Success\n");
					gap_cmd_resp_wait();/* waiting for HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE */
				}
			} else {
				LOG_INFO_APP("==>> hci_le_set_phy PHY Param  TX= %d, RX= %d - ",
						HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF);
				status =
						hci_le_set_phy(
								bleAppContext.BleApplicationContext_legacy.connectionHandle,
								0, HCI_TX_PHYS_LE_2M_PREF,
								HCI_RX_PHYS_LE_2M_PREF, 0);
				if (status != BLE_STATUS_SUCCESS) {
					LOG_INFO_APP("Fail\n");
				} else {
					LOG_INFO_APP("Success\n");
					gap_cmd_resp_wait();/* waiting for HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE */
				}
			}
		}
		break;
	}/* PROC_GAP_GEN_PHY_TOGGLE */
	case PROC_GAP_GEN_CONN_TERMINATE: {
		status = aci_gap_terminate(
				bleAppContext.BleApplicationContext_legacy.connectionHandle,
				HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("aci_gap_terminate failure: reason=0x%02X\n", status);
		} else {
			LOG_INFO_APP("==>> aci_gap_terminate : Success\n");
		}
		gap_cmd_resp_wait();/* waiting for HCI_DISCONNECTION_COMPLETE_EVT_CODE */
		break;
	}/* PROC_GAP_GEN_CONN_TERMINATE */
	case PROC_GATT_EXCHANGE_CONFIG: {
		status = aci_gatt_exchange_config(
				bleAppContext.BleApplicationContext_legacy.connectionHandle);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("aci_gatt_exchange_config failure: reason=0x%02X\n",
					status);
		} else {
			LOG_INFO_APP("==>> aci_gatt_exchange_config : Success\n");
		}
		break;
	}
		/* USER CODE BEGIN GAP_GENERAL */

		/* USER CODE END GAP_GENERAL */
	default:
		break;
	}
	return;
}

void APP_BLE_Procedure_Gap_Peripheral(ProcGapPeripheralId_t ProcGapPeripheralId) {
	tBleStatus status;
	uint32_t paramA = ADV_INTERVAL_MIN;
	uint32_t paramB = ADV_INTERVAL_MAX;
	uint32_t paramC, paramD;

	/* First set parameters before calling ACI APIs, only if needed */
	switch (ProcGapPeripheralId) {
	case PROC_GAP_PERIPH_ADVERTISE_START_FAST: {
		paramA = ADV_INTERVAL_MIN;
		paramB = ADV_INTERVAL_MAX;
		paramC = APP_BLE_ADV_FAST;

		break;
	}/* PROC_GAP_PERIPH_ADVERTISE_START_FAST */
	case PROC_GAP_PERIPH_ADVERTISE_START_LP: {
		paramA = ADV_LP_INTERVAL_MIN;
		paramB = ADV_LP_INTERVAL_MAX;
		paramC = APP_BLE_ADV_LP;

		break;
	}/* PROC_GAP_PERIPH_ADVERTISE_START_LP */
	case PROC_GAP_PERIPH_ADVERTISE_STOP: {
		paramC = APP_BLE_IDLE;

		break;
	}/* PROC_GAP_PERIPH_ADVERTISE_STOP */
	case PROC_GAP_PERIPH_CONN_PARAM_UPDATE: {
		paramA = CONN_INT_MS(1000);
		paramB = CONN_INT_MS(1000);
		paramC = 0x0000;
		paramD = 0x01F4;

		/* USER CODE BEGIN CONN_PARAM_UPDATE */
		if (bleAppContext.connIntervalFlag != 0) {
			bleAppContext.connIntervalFlag = 0;
			paramA = CONN_INT_MS(50);
			paramB = CONN_INT_MS(50);
		} else {
			bleAppContext.connIntervalFlag = 1;
			paramA = CONN_INT_MS(1000);
			paramB = CONN_INT_MS(1000);
		}
		/* USER CODE END CONN_PARAM_UPDATE */
		break;
	}/* PROC_GAP_PERIPH_CONN_PARAM_UPDATE */
	default:
		break;
	}

	/* Call ACI APIs */
	switch (ProcGapPeripheralId) {
	case PROC_GAP_PERIPH_ADVERTISE_START_FAST:
	case PROC_GAP_PERIPH_ADVERTISE_START_LP: {
		/* Start Fast or Low Power Advertising */
		status = aci_gap_set_discoverable(ADV_TYPE, paramA, paramB,
		CFG_BD_ADDRESS_TYPE,
		ADV_FILTER, 0, 0, 0, 0, 0, 0);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP(
					"==>> aci_gap_set_discoverable - fail, result: 0x%02X\n",
					status);
		} else {
			bleAppContext.Device_Connection_Status =
					(APP_BLE_ConnStatus_t) paramC;
			LOG_INFO_APP("==>> aci_gap_set_discoverable - Success\n");
		}

		status = aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("==>> delete tx power level - fail, result: 0x%02X\n",
					status);
		}

