stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
		/* Update Advertising data */
		status = aci_gap_update_adv_data(sizeof(a_AdvData),
				(uint8_t*) a_AdvData);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("==>> Start Advertising Failed, result: 0x%02X\n",
					status);
		} else {
			LOG_INFO_APP("==>> Success: Start Advertising\n");
		}
		break;
	}
	case PROC_GAP_PERIPH_ADVERTISE_STOP: {
		status = aci_gap_set_non_discoverable();
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP(
					"aci_gap_set_non_discoverable - fail, result: 0x%02X\n",
					status);
		} else {
			bleAppContext.Device_Connection_Status =
					(APP_BLE_ConnStatus_t) paramC;
			LOG_INFO_APP("==>> aci_gap_set_non_discoverable - Success\n");
		}
		break;
	}/* PROC_GAP_PERIPH_ADVERTISE_STOP */
	case PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE: {
		status = aci_gap_update_adv_data(sizeof(a_AdvData),
				(uint8_t*) a_AdvData);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("aci_gap_update_adv_data - fail, result: 0x%02X\n",
					status);
		} else {
			LOG_INFO_APP("==>> aci_gap_update_adv_data - Success\n");
		}

		break;
	}/* PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE */
	case PROC_GAP_PERIPH_CONN_PARAM_UPDATE: {
		status = aci_l2cap_connection_parameter_update_req(
				bleAppContext.BleApplicationContext_legacy.connectionHandle,
				paramA, paramB, paramC, paramD);
		if (status != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP(
					"aci_l2cap_connection_parameter_update_req - fail, result: 0x%02X\n",
					status);
		} else {
			LOG_INFO_APP(
					"==>> aci_l2cap_connection_parameter_update_req - Success\n");
		}

		break;
	}/* PROC_GAP_PERIPH_CONN_PARAM_UPDATE */

	case PROC_GAP_PERIPH_SET_BROADCAST_MODE: {

		break;
	}/* PROC_GAP_PERIPH_SET_BROADCAST_MODE */
	default:
		break;
	}
	return;
}

/* USER CODE BEGIN FD*/
void APP_BLE_AdvStart(void) {
	osMutexAcquire(LinkLayerMutex, osWaitForever);
	APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
	osMutexRelease(LinkLayerMutex);
	
}

void APP_BLE_AdvLowPower(void) {
	osMutexAcquire(LinkLayerMutex, osWaitForever);
	APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
	APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);
	osMutexRelease(LinkLayerMutex);
}


void APP_BLE_AdvStop(void) {
	osMutexAcquire(LinkLayerMutex, osWaitForever);
	APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
	osMutexRelease(LinkLayerMutex);
}

/* USER CODE END FD*/

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
uint8_t HOST_BLE_Init(void) {
	tBleStatus return_status = BLE_STATUS_FAILED;

	pInitParams.numAttrRecord = CFG_BLE_NUM_GATT_ATTRIBUTES;
	pInitParams.numAttrServ = CFG_BLE_NUM_GATT_SERVICES;
	pInitParams.attrValueArrSize = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
	pInitParams.prWriteListSize = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
	pInitParams.attMtu = CFG_BLE_ATT_MTU_MAX;
	pInitParams.max_coc_nbr = CFG_BLE_COC_NBR_MAX;
	pInitParams.max_coc_mps = CFG_BLE_COC_MPS_MAX;
	pInitParams.max_coc_initiator_nbr = CFG_BLE_COC_INITIATOR_NBR_MAX;
	pInitParams.numOfLinks = CFG_BLE_NUM_LINK;
	pInitParams.mblockCount = CFG_BLE_MBLOCK_COUNT;
	pInitParams.bleStartRamAddress = (uint8_t*) buffer;
	pInitParams.total_buffer_size = BLE_DYN_ALLOC_SIZE;
	pInitParams.bleStartRamAddress_GATT = (uint8_t*) gatt_buffer;
	pInitParams.total_buffer_size_GATT = BLE_GATT_BUF_SIZE;
	pInitParams.options = CFG_BLE_OPTIONS;
	pInitParams.debug = 0U;
	/* USER CODE BEGIN HOST_BLE_Init_Params */

	/* USER CODE END HOST_BLE_Init_Params */
	return_status = BleStack_Init(&pInitParams);
	/* USER CODE BEGIN HOST_BLE_Init */

	/* USER CODE END HOST_BLE_Init */
	return ((uint8_t) return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void) {
	uint8_t role;
	uint16_t gap_service_handle, gap_dev_name_char_handle,
			gap_appearance_char_handle;
	const uint8_t *p_bd_addr;
	uint16_t a_appearance[1] = { CFG_GAP_APPEARANCE };
	tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

	/* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init*/

	/* USER CODE END Ble_Hci_Gap_Gatt_Init*/

	LOG_INFO_APP("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

	/* Write the BD Address */
	p_bd_addr = BleGetBdAddress();
	ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
	CONFIG_DATA_PUBADDR_LEN, (uint8_t*) p_bd_addr);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP(
				"  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
		LOG_INFO_APP(
				"  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",
				p_bd_addr[5], p_bd_addr[4], p_bd_addr[3], p_bd_addr[2],
				p_bd_addr[1], p_bd_addr[0]);
	}

	/* Write Identity root key used to derive IRK and DHK(Legacy) */
	ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN,
			(uint8_t*) a_BLE_CfgIrValue);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP(
				"  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
	}

	/* Write Encryption root key used to derive LTK and CSRK */
	ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN,
			(uint8_t*) a_BLE_CfgErValue);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP(
				"  Success: aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET\n");
	}

	/* Set Transmission RF Power. */
	ret = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : aci_hal_set_tx_power_level command, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP("  Success: aci_hal_set_tx_power_level command\n");
	}

	/* Initialize GATT interface */
	ret = aci_gatt_init();
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP("  Fail   : aci_gatt_init command, result: 0x%02X\n", ret);
	} else {
		LOG_INFO_APP("  Success: aci_gatt_init command\n");
	}

	/* Initialize GAP interface */
	role = 0U;
	role |= GAP_PERIPHERAL_ROLE;

	/* USER CODE BEGIN Role_Mngt*/

