stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
	/* USER CODE END Role_Mngt */

	if (role > 0) {
		ret = aci_gap_init(role,
		CFG_PRIVACY, sizeof(a_GapDeviceName), &gap_service_handle,
				&gap_dev_name_char_handle, &gap_appearance_char_handle);

		if (ret != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP("  Fail   : aci_gap_init command, result: 0x%02X\n",
					ret);
		} else {
			LOG_INFO_APP("  Success: aci_gap_init command\n");
		}

		ret = aci_gatt_update_char_value(gap_service_handle,
				gap_dev_name_char_handle, 0, sizeof(a_GapDeviceName),
				(uint8_t*) a_GapDeviceName);
		if (ret != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP(
					"  Fail   : aci_gatt_update_char_value - Device Name, result: 0x%02X\n",
					ret);
		} else {
			LOG_INFO_APP(
					"  Success: aci_gatt_update_char_value - Device Name\n");
		}

		ret = aci_gatt_update_char_value(gap_service_handle,
				gap_appearance_char_handle, 0, sizeof(a_appearance),
				(uint8_t*) &a_appearance);
		if (ret != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP(
					"  Fail   : aci_gatt_update_char_value - Appearance, result: 0x%02X\n",
					ret);
		} else {
			LOG_INFO_APP(
					"  Success: aci_gatt_update_char_value - Appearance\n");
		}
	} else {
		LOG_ERROR_APP("GAP role cannot be null\n");
	}

	/* Initialize Default PHY */
	ret = hci_le_set_default_phy(CFG_PHY_PREF, CFG_PHY_PREF_TX,
			CFG_PHY_PREF_RX);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : hci_le_set_default_phy command, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP("  Success: hci_le_set_default_phy command\n");
	}

	/* Initialize IO capability */
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability =
			CFG_IO_CAPABILITY;
	ret =
			aci_gap_set_io_capability(
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : aci_gap_set_io_capability command, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP("  Success: aci_gap_set_io_capability command\n");
	}

	/* Initialize authentication */
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode =
			CFG_MITM_PROTECTION;
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin =
			CFG_ENCRYPTION_KEY_SIZE_MIN;
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax =
			CFG_ENCRYPTION_KEY_SIZE_MAX;
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin =
			CFG_USED_FIXED_PIN;
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin =
			CFG_FIXED_PIN;
	bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode =
			CFG_BONDING_MODE;
	/* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init_1*/
	fill_advData(&a_AdvData[0], sizeof(a_AdvData), (uint8_t*) p_bd_addr);
	/* USER CODE END Ble_Hci_Gap_Gatt_Init_1*/

	ret =
			aci_gap_set_authentication_requirement(
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
					CFG_SC_SUPPORT,
					CFG_KEYPRESS_NOTIFICATION_SUPPORT,
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
					bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin,
					CFG_BD_ADDRESS_TYPE);
	if (ret != BLE_STATUS_SUCCESS) {
		LOG_INFO_APP(
				"  Fail   : aci_gap_set_authentication_requirement command, result: 0x%02X\n",
				ret);
	} else {
		LOG_INFO_APP(
				"  Success: aci_gap_set_authentication_requirement command\n");
	}

	/* Initialize whitelist */
	if (bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode) {
		ret = aci_gap_configure_whitelist();
		if (ret != BLE_STATUS_SUCCESS) {
			LOG_INFO_APP(
					"  Fail   : aci_gap_configure_whitelist command, result: 0x%02X\n",
					ret);
		} else {
			LOG_INFO_APP("  Success: aci_gap_configure_whitelist command\n");
		}
	}

	LOG_INFO_APP("==>> End Ble_Hci_Gap_Gatt_Init function\n");

	return;
}

static void Ble_UserEvtRx(void) {
	SVCCTL_UserEvtFlowStatus_t svctl_return_status;
	BleEvtPacket_t *phcievt;

	LST_remove_head(&BleAsynchEventQueue, (tListNode**) &phcievt);

	svctl_return_status = SVCCTL_UserEvtRx((void*) &(phcievt->evtserial));

	if (svctl_return_status != SVCCTL_UserEvtFlowDisable) {
		AMM_Free((uint32_t*) phcievt);
	} else {
		LST_insert_head(&BleAsynchEventQueue, (tListNode*) phcievt);
	}

	if ((LST_is_empty(&BleAsynchEventQueue) == FALSE)
			&& (svctl_return_status != SVCCTL_UserEvtFlowDisable)) {
		osSemaphoreRelease(HCIasyncEvtSemaphore);
	}

	/* set the BG_BleStack_Process task for scheduling */
	osSemaphoreRelease(BleStackSemaphore);

}

static const uint8_t* BleGetBdAddress(void) {
	OTP_Data_s *p_otp_addr = NULL;
	const uint8_t *p_bd_addr;
	uint32_t udn;
	uint32_t company_id;
	uint32_t device_id;

	udn = LL_FLASH_GetUDN();

	if (udn != 0xFFFFFFFF) {
		company_id = LL_FLASH_GetSTCompanyID();
		device_id = LL_FLASH_GetDeviceID();

		/**
		 * Public Address with the ST company ID
		 * bit[47:24] : 24bits (OUI) equal to the company ID
		 * bit[23:16] : Device ID.
		 * bit[15:0] : The last 16bits from the UDN
		 * Note: In order to use the Public Address in a final product, a dedicated
		 * 24bits company ID (OUI) shall be bought.
		 */
		a_BdAddrUdn[0] = (uint8_t) (udn & 0x000000FF);
		a_BdAddrUdn[1] = (uint8_t) ((udn & 0x0000FF00) >> 8);
		a_BdAddrUdn[2] = (uint8_t) device_id;
		a_BdAddrUdn[3] = (uint8_t) (company_id & 0x000000FF);
		a_BdAddrUdn[4] = (uint8_t) ((company_id & 0x0000FF00) >> 8);
		a_BdAddrUdn[5] = (uint8_t) ((company_id & 0x00FF0000) >> 16);

		p_bd_addr = (const uint8_t*) a_BdAddrUdn;
	} else {
		OTP_Read(0, &p_otp_addr);
		if (p_otp_addr) {
			p_bd_addr = (uint8_t*) (p_otp_addr->bd_address);
		} else {
			p_bd_addr = a_MBdAddr;
		}
	}

	return p_bd_addr;
}

static void BleStack_Process_BG(void) {
	uint8_t running = 0x0;

	osMutexAcquire(LinkLayerMutex, osWaitForever);
	running = BleStack_Process();
	osMutexRelease(LinkLayerMutex);
	if (running == 0x0) {
		BleStackCB_Process();
	}
}

static void gap_cmd_resp_release(void) {
	osSemaphoreRelease(ProcGapCompleteSemaphore);
	return;
}

static void gap_cmd_resp_wait(void) {
	osSemaphoreAcquire(ProcGapCompleteSemaphore, osWaitForever);
	return;
}

/**
 * @brief  Notify the LL to resume the flow process
 * @param  None
 * @retval None
 */
static void BLE_ResumeFlowProcessCallback(void) {
	/* Receive any events from the LL. */
	change_state_options_t notify_options;

	notify_options.combined_value = 0x0F;

	ll_intf_chng_evnt_hndlr_state(notify_options);
}

static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus) {
	if (CbkStatus != SNVMA_OPERATION_COMPLETE) {
		/* Retry the write operation */
		SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
	}
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

