stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Generic-Switch-App/STM32_WPAN/App/app_ble.c
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size,
		const uint8_t *p_bd_addr) {
	uint16_t i = 0;
	//uint8_t bd_addr_1, bd_addr_0;
	uint8_t ad_length, ad_type;

	while (i < tab_size) {
		ad_length = p_adv_data[i];
		ad_type = p_adv_data[i + 1];

		switch (ad_type) {

		case AD_TYPE_SERVICE_DATA:
#if (CONFIG_STM32_FACTORY_DATA_ENABLE == 1)
			 FACTORYDATA_StatusTypeDef err = DATAFACTORY_OK;
			 uint32_t tlvDataLength = 0;
			 uint16_t setupDiscriminator = 0;
			 uint16_t vendorId = 0;
			 uint16_t productId = 0;

			 err = FACTORYDATA_GetValue(TAG_ID_SETUP_DISCRIMINATOR, (uint8_t *) &setupDiscriminator,
					                    sizeof(setupDiscriminator), &tlvDataLength);

			 if (err == DATAFACTORY_OK )
			 {
				 p_adv_data[i+5] = (uint8_t) (setupDiscriminator & 0xFF);
				 p_adv_data[i+6] = (uint8_t) (setupDiscriminator >>8) ;
			 }
			 else
			 {
				 LOG_INFO_APP("Failed to get from Factory Data Discriminator.\n");
			 }

			 err = FACTORYDATA_GetValue(TAG_ID_VENDOR_ID, (uint8_t *) &vendorId,
			 					                    sizeof(vendorId), &tlvDataLength);
			 if (err == DATAFACTORY_OK )
			 {
				 p_adv_data[i+7] = (uint8_t) (vendorId & 0xFF);
				 p_adv_data[i+8] = (uint8_t) (vendorId >>8);
			 }
			 else
			 {
				 LOG_INFO_APP("Failed to get from Factory Data VendorId.\n");
			 }


			 err = FACTORYDATA_GetValue(TAG_ID_PRODUCT_ID, (uint8_t *) &productId,
			 					                    sizeof(productId), &tlvDataLength);
			 if (err == DATAFACTORY_OK )
			 {
			     p_adv_data[i+9] = (uint8_t) (productId & 0xFF);
			     p_adv_data[i+10] = (uint8_t) (productId >> 8);
			 }
			 else
			 {
				 LOG_INFO_APP("Failed to get from Factory Data ProductId.\n");
			 }



#else
			p_adv_data[i+5] = (uint8_t) (CHIP_DEVICE_CONFIG_USE_TEST_SETUP_DISCRIMINATOR & 0xFF);
			p_adv_data[i+6] = (uint8_t) (CHIP_DEVICE_CONFIG_USE_TEST_SETUP_DISCRIMINATOR >> 8);
			p_adv_data[i+7] = (uint8_t) (CHIP_DEVICE_CONFIG_DEVICE_VENDOR_ID & 0xFF);
			p_adv_data[i+8] = (uint8_t) (CHIP_DEVICE_CONFIG_DEVICE_VENDOR_ID >> 8);
			p_adv_data[i+9] = (uint8_t) (CHIP_DEVICE_CONFIG_DEVICE_PRODUCT_ID &0xFF);
			p_adv_data[i+10] = (uint8_t) (CHIP_DEVICE_CONFIG_DEVICE_PRODUCT_ID >>8);
#endif /* CONFIG_STM32_FACTORY_DATA_ENABLE */
			break;
		case AD_TYPE_COMPLETE_LOCAL_NAME:
		case AD_TYPE_TX_POWER_LEVEL:
		case AD_TYPE_FLAGS:
		case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
		default:
			break;
		}
		i += ad_length + 1; /* increment the iterator to go on next element*/
	}
}
/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

tBleStatus BLECB_Indication(const uint8_t *data, uint16_t length,
		const uint8_t *ext_data, uint16_t ext_length) {
	uint8_t status = BLE_STATUS_FAILED;
	BleEvtPacket_t *phcievt;
	uint16_t total_length = (length + ext_length);

	UNUSED(ext_data);

	if (data[0] == HCI_EVENT_PKT_TYPE) {
		APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
		if (AMM_Alloc(CFG_AMM_VIRTUAL_APP_BLE,
				DIVC((sizeof(BleEvtPacketHeader_t) + total_length),
						sizeof(uint32_t)), (uint32_t**) &phcievt,
				&APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK) {
			LOG_INFO_APP("Alloc failed\n");
			status = BLE_STATUS_FAILED;
		} else if (phcievt != (BleEvtPacket_t*) 0) {
			phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
			phcievt->evtserial.evt.evtcode = data[1];
			phcievt->evtserial.evt.plen = data[2];
			memcpy((void*) &phcievt->evtserial.evt.payload, &data[3], data[2]);
			LST_insert_tail(&BleAsynchEventQueue, (tListNode*) phcievt);
			osSemaphoreRelease(HCIasyncEvtSemaphore);
			status = BLE_STATUS_SUCCESS;
		}
	} else if (data[0] == HCI_ACLDATA_PKT_TYPE) {
		status = BLE_STATUS_SUCCESS;
	}
	return status;
}
static void BleUserEvtRx_Task_Entry(void *argument) {

#if HIGHWATERMARK
    UBaseType_t uxHighWaterMark;
    UBaseType_t lastHighWaterMark = 0;
#endif
    while (1) {
        osSemaphoreAcquire(HCIasyncEvtSemaphore, osWaitForever);

        osMutexAcquire(LinkLayerMutex, osWaitForever);
        Ble_UserEvtRx();
        osMutexRelease(LinkLayerMutex);
        osThreadYield();

#if HIGHWATERMARK
        uxHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        if (uxHighWaterMark != lastHighWaterMark) {
            APP_DBG("\x1b[34m" "BleUserEvtRxTaskEntry_stack_HighWaterMark %lu \n" "\x1b[0m", uxHighWaterMark);
            lastHighWaterMark = uxHighWaterMark;
        }
#endif
    }
}

static void BleStack_Task_Entry(void *argument) {
	UNUSED(argument);
#if HIGHWATERMARK
    UBaseType_t uxHighWaterMark;
    UBaseType_t lastHighWaterMark = 0;
#endif // endif HIGHWATERMARK

	while (1) {
		osSemaphoreAcquire(BleStackSemaphore, osWaitForever);
		BleStack_Process_BG();
		osThreadYield();

#if HIGHWATERMARK
        uxHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        if (uxHighWaterMark != lastHighWaterMark) {
            APP_DBG("\x1b[34m" "BleStackTaskEntry_stack_HighWaterMark %lu \n" "\x1b[0m", uxHighWaterMark);
            lastHighWaterMark = uxHighWaterMark;
        }
#endif
	}
}


void NVMCB_Store(const uint32_t *ptr, uint32_t size) {
	UNUSED(ptr);
	UNUSED(size);

	/* Call SNVMA for storing - Without callback */
	SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */



/* USER CODE END FD_WRAP_FUNCTIONS */
